// Дан массив с числами. Найдите среднее арифметическое его элементов (сумма элементов делить на количество) не используя цикл.
<?php
$arr = [1,2,3,4,5,6,7,8];
$y = count($arr);
$x = array_sum($arr);
echo $x / $y;
?>

// Найдите сумму чисел от 1 до 100 не используя цикл.
<?php
$arr = range(1,100);
$arr .= array_sum($arr);
echo $arr;
?>

// Выведите столбец чисел от 1 до 100 не используя цикл.
<?php
$arr = range(1,100);
echo $arr . '/br';
?>

// Заполните массив 10-ю иксами не используя цикл.
<?php
echo str_repeat('x', 10);
?>

// Заполните массив 10-ю случайными числами от 1 до 10 так, чтобы они не повторялись. Цикл использовать нельзя.
<?php
$arr = range(1,10);
shuffle($arr);
var_dump($arr);
?>

// Найдите факториал заданного числа не используя цикл. Факториал - это произведение чисел от 1 до заданного числа включительно.
<?php
$arr = range(1,10);
array_product($arr);
var_dump($arr);
?>

// Дано число. Найдите сумму цифр этого числа не используя цикл.
<?php
$num = 123;
$arr = str_split($num, 1);
echo array_sum($arr);
?>

// Дана строка. Сделайте заглавным последний символ этой строки не используя цикл.
<?php
$num = 'Lorem ipsum dolor';
$num = strrev($num);
$num = ucfirst($num);
$num = strrev($num);
echo $num;
?>

// Дан массив с числами. Получите из него массив с квадратными корнями этих чисел не используя цикл.
<?php
$arr = [2,2,4,8,16,6,14,8];
foreach ($arr as $value){
    $x = sqrt($value);
    var_dump($x);
}
?>

// Заполните массив числами от 1 до 26 так, чтобы ключами этих чисел были буквы английского алфавита: ['a'=>1, 'b'=>2...]. Сделайте это не используя цикл.
<?php
$str = range('a', 'z');
$int = range(1,26);
$x = array_combine($int, $str);
var_dump($x);
?>

// Дана строка с числами '1234567890'. Найдите сумму пар чисел: 12+34+56+78+90. Решите задачу, не используя цикл.
<?php
$arr = [1234567890];
$str = implode($arr);
$int = str_split($str, 2);
var_dump($int);
$sum = array_sum($int);
var_dump($sum);
?>











